In [1]:
import pandas as pd

In [2]:
data = {
    'CustomerID':[201,202,203,204,205],
    'CustomerName': [' Riya_Sharma ','  Micheal Smith  ',' karan kundra ','James neal ',' lisa_kim '],
    'Email' : [' riya1@gmail.com ',' micheal2@work.net ',' karan@domain.com ',' james@now.com ',' lisa_kim@mail.com ']
}
df = pd.DataFrame(data)
df

   CustomerID       CustomerName                Email
0         201       Riya_Sharma      riya1@gmail.com
1         202    Micheal Smith     micheal2@work.net
2         203      karan kundra     karan@domain.com
3         204        James neal        james@now.com
4         205          lisa_kim    lisa_kim@mail.com

#### Strip leading and trailing spaces in the CustomerName column.

In [3]:
df1 = df['CustomerName'].str.strip()

In [4]:
df1

0      Riya_Sharma
1    Micheal Smith
2     karan kundra
3       James neal
4         lisa_kim
Name: CustomerName, dtype: object

#### Convert all names in CustomerName to lowercase, then to title case.

In [5]:
df['CustomerName'].str.lower()

0         riya_sharma
1      micheal smith
2        karan kundra
3          james neal
4            lisa_kim
Name: CustomerName, dtype: object

### Replace underscores (_), hyphens (-), and dots (.) in CustomerName with a space

In [6]:
df['CustomerName'].str.replace('_','  ').str.replace('-','  ').str.replace('.',' ')

0        Riya  Sharma
1      Micheal Smith
2        karan kundra
3          James neal
4           lisa  kim
Name: CustomerName, dtype: object

In [7]:
df['CustomerName']=df['CustomerName'].str.replace(r'[_\-\.]','_____',regex=True)  #next process

In [8]:
df

   CustomerID       CustomerName                Email
0         201   Riya_____Sharma      riya1@gmail.com
1         202    Micheal Smith     micheal2@work.net
2         203      karan kundra     karan@domain.com
3         204        James neal        james@now.com
4         205      lisa_____kim    lisa_kim@mail.com

####  4. Count how many names in CustomerName contain the word "smith" (case-insensitive).

In [9]:
df ['CustomerName']

0     Riya_____Sharma
1      Micheal Smith
2        karan kundra
3          James neal
4        lisa_____kim
Name: CustomerName, dtype: object

In [10]:
df['CustomerName'].str.count("smith")

0    0
1    0
2    0
3    0
4    0
Name: CustomerName, dtype: int64

In [11]:
df['CustomerName'].str.count("Smith")

0    0
1    1
2    0
3    0
4    0
Name: CustomerName, dtype: int64

#### 5. Find and return all rows where Email ends with .com.

In [13]:
df[df['Email'].str.endswith(".com")]

Empty DataFrame
Columns: [CustomerID, CustomerName, Email]
Index: []